In [15]:
# Import required dependencies
import pandas as pd
import os
from pathlib import Path

# Create the path and import the data
full_student_data = Path('Student_Data_Challenge_Starter_Code/Resources/new_full_student_data.csv')
student_df = pd.read_csv(full_student_data)

# Verify that the data were properly imported
student_df.head(10)

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324
5,74579444,Cynthia Johnson,9th,Montgomery High School,63.5,76.9,Charter,893368
6,52067716,Thomas Wilson,12th,Montgomery High School,75.6,53.4,Charter,893368
7,112864862,Stephanie Torres,9th,Montgomery High School,64.8,76.5,Charter,893368
8,75984300,Victoria Lewis,10th,Campbell High School,65.7,96.1,Charter,960726
9,76307038,Kristen Torres,12th,Campos High School,62.9,90.4,Public,957299

In [16]:
# Check for null values
student_df.isnull().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [17]:
# Drop null values and verify removal
student_df = student_df.dropna()
student_df.isnull().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [6]:
# Check for duplicated rows
student_df.duplicated().sum()

2168

In [18]:
# Drop duplicated rows and verify removal
student_df = student_df.drop_duplicates()
student_df.duplicated().sum()

0

In [14]:
# Check data types
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [19]:
# Examine the 'grade' column to find why it is not an int
student_df['grade']
# Oh yeah, it contains non-numeric characters in its values.

0         9th
1         9th
2         9th
3         9th
5         9th
         ...
19508    10th
19509    12th
19511    11th
19512    11th
19513    12th
Name: grade, Length: 14831, dtype: object

In [21]:
# Remove the non-numeric characters and verify the contents of the column
student_df.loc[:,'grade'] = student_df.loc[:, 'grade'].str.replace("th", "")
student_df.loc[:, 'grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: object

In [25]:
# Change the 'grade' column to the int type and verify column types
student_df.loc[:, 'grade'] = student_df.loc[:, 'grade'].astype("int")
student_df.loc[:, 'grade'].dtypes

dtype('int32')

In [26]:
# Display summary statistics for the student dataframe
student_df.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [28]:
# Display the mean math score using the mean function
student_df.loc[:, 'math_score'].mean()

64.67573326141189

In [29]:
# Store the minimum reading score as min_reading_score
min_reading_score = student_df.loc[:, 'reading_score'].min()
min_reading_score

10.5

In [30]:
student_df.loc[:, 'grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: int32

In [31]:
student_df.iloc[0:3, [3, 4, 5]]

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [36]:
# Show the rows for grade 9 using loc
grade_nine_students_df = student_df.loc[student_df['grade'] == 9]
grade_nine_students_df

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9,Silva High School,69.7,80.3,Public,991918
5,74579444,Cynthia Johnson,9,Montgomery High School,63.5,76.9,Charter,893368
...,...,...,...,...,...,...,...,...
19477,14165038,William Smith,9,Dixon High School,69.8,65.0,Charter,870334
19478,46569330,Angie Flowers,9,Bowers High School,50.4,61.7,Public,848324
19481,99423494,Sherry Rogers,9,Silva High School,47.0,88.4,Public,991918
19493,68274108,Mary Murray,9,Wagner High School,63.4,53.4,Public,846745
19497,56856952,Joshua Holmes,9,Wagner High School,77.2,76.5,Public,846745

In [38]:
# Store the row with the overall minimum reading score as min_reading_row using loc
# and the min_reading_score found in deliverable 3
min_reading_row = student_df.loc[student_df['reading_score'] == min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [67]:
# Find the reading scores for the school and the grade from the output of step 3 using loc
# with multiple conditional statements
grade_nine_reading_scores_df = student_df.loc[student_df['grade'] == 9, ['school_name', 'reading_score']]
grade_nine_reading_scores_df
# I am not sure how to include multiple conditional statements here without redundancy.

                  school_name  reading_score
0        Sullivan High School           59.0
1           Dixon High School           94.7
2          Wagner High School           89.0
3           Silva High School           69.7
5      Montgomery High School           63.5
...                       ...            ...
19477       Dixon High School           69.8
19478      Bowers High School           50.4
19481       Silva High School           47.0
19493      Wagner High School           63.4
19497      Wagner High School           77.2

[4132 rows x 2 columns]

In [104]:
# Using conditional statements and loc or iloc, find the mean reading score for students in grades 11 and 12 combined.
upper_classmen_df = student_df.loc[student_df['grade'] > 10]

upper_classmen_reading_scores = upper_classmen_df['reading_score']
upper_classmen_reading_scores.mean()

74.90038089192188

In [89]:
# Using groupby and mean functions, look at the average reading and math scores for each school type
school_type_group_df = student_df.groupby('school_type')
school_type_group_df.mean()

               student_id      grade  reading_score  math_score  school_budget
school_type
Charter      7.004029e+07  10.346744      72.450603   66.761883  872625.656236
Public       6.951549e+07  10.362808      72.281219   62.951576  911195.558251

In [106]:
# Using groupby and count functions, find the total number of students at each school
school_names_group_df = student_df.groupby('school_name').count()
school_names_group_df.loc[:, 'student_id'].sort_values(ascending = False)

school_name
Montgomery High School    2038
Green High School         1961
Dixon High School         1583
Wagner High School        1541
Silva High School         1109
Woods High School         1052
Sullivan High School       971
Turner High School         846
Bowers High School         803
Fisher High School         798
Richard High School        551
Campos High School         541
Odonnell High School       459
Campbell High School       407
Chang High School          171
Name: student_id, dtype: int64

In [99]:
# Using groupby and mean functions, find the average budget per grade for each school type
school_type_budget_group_df = student_df.groupby(['school_type', 'grade']).mean()
school_type_budget_group_df.loc[:, 'school_budget']

school_type  grade
Charter      9        863817.290130
             10       871823.608811
             11       874262.713649
             12       885096.335017
Public       9        926800.159528
             10       914715.360382
             11       900248.905136
             12       895952.915971
Name: school_budget, dtype: float64

In [109]:
# Using groupby and mean functions, find the average math score by grade for each school type
mean_math_score_by_grade_group_df = student_df.groupby(['school_type', 'grade']).mean()
round(mean_math_score_by_grade_group_df.loc[:, 'math_score'], 1)

school_type  grade
Charter      9        70.1
             10       66.4
             11       68.0
             12       60.2
Public       9        63.8
             10       63.8
             11       59.3
             12       63.6
Name: math_score, dtype: float64